<template>
  <Modal title="Оферта регулярных платежей" closable>
    <template class="offer-modal-template" v-slot:default>
      <div class="offer-modal-template">
        <h1 class="offer-title">СОГЛАШЕНИЕ О ПРЕДОСТАВЛЕНИИ ФИЗИЧЕСКИМ ЛИЦАМ ВОЗМОЖНОСТИ ОПЛАТЫ ТОВАРОВ/РАБОТ/УСЛУГ ИП МАСЛОВ ДЕНИС ДМИТРИЕВИЧ ПОСРЕДСТВОМ РЕГУЛЯРНЫХ АВТОМАТИЧЕСКИХ ПЕРЕВОДОВ ДЕНЕЖНЫХ СРЕДСТВ.</h1>
        <h2 class="offer-desc">ИП Маслов Денис Дмитриевич, зарегистрированный по адресу  141801, Московская область, Дмитровский район, г. Дмитров, ул. архитектора В.В. Белоброва, д. 3, кв. 70, действующий на основании свидетельства  317500700026101, именуемый в дальнейшем Поставщик, предлагает Пользователям воспользоваться Сервисом «Рекуррентные списания» и заключить настоящее соглашение (далее — Соглашение), являющееся дополнением к Договору и неотъемлемой частью Договора, об определении порядка расчетов по Договору. Пользователь безусловно соглашается с настоящим Соглашением пользования сервисом путём совершения конклюдентных действий по подключению Сервиса «Рекуррентные списания» в момент принятия Пользователем настоящего соглашения пользования сервисом и выполнения действий по активации Сервиса «Рекуррентные списания». </h2>
        <h2 class="offer-desc-2-title">Термины и определения</h2>
        <h2 class="offer-desc-2-desc">Сервис «Рекуррентные списания» — сервис по осуществлению регулярных автоматических переводов денежных средств с Банковской карты Держателя в пользу Поставщика за предоставляемые Поставщиком товары/услуги по Договору на основании заранее данного акцепта Держателя карты, в соответствии с тарифами и опциями по Договору. 
Договор – двустороннее  соглашение, заключенное между Пользователем и Поставщиком, по условиям которого Поставщик обязуется предоставить Пользователю Услугу, а последний обязуется оплатить ее. 
Услуга — предоставление Поставщиком услуги из ассортимента сайта https://moneyhunter.pro/. 
Пользователь — физическое лицо, заключившее Договор с Поставщиком. 
Банк – кредитная организация —  АО «Тинькофф Банк» 
БИК:044525974 
К/с:30101810145250000974 
Запрос – информационное сообщение, направляемое Банком в Банк-эмитент на перевод денежных средств с Банковской карты в пользу Поставщика. 
Банк-эмитент — кредитная организация, осуществляющая выпуск Банковских карт, а также расчеты по операциям, совершаемым с использованием Банковских карт. 
Процессинговый центр —  АО «Тинькофф Банк» 
БИК:044525974 
К/с:30101810145250000974 
Держатель карты – физическое лицо, дающее распоряжение Банку-эмитенту на перевод денежных средств с Банковской карты от имени Пользователя в пользу Поставщика с помощью Сервиса «Рекуррентные списания». 
Банковская карта — расчетная или кредитная карта, эмитентом которой является Банк-эмитент, являющаяся инструментом безналичных расчетов, предназначенная для совершения Держателем карты операций с денежными средствами, находящимися на банковских счетах Держателя карты в Банке-эмитенте, или с денежными средствами, предоставленными Банком-эмитентом в кредит Держателю карты в соответствии с законодательством Российской Федерации, а также договором банковского счета, или в пределах установленного лимита, в соответствии с условиями кредитного договора между Банком-эмитентом и Держателем карты, при условии, что такая расчетная или кредитная карта может быть использована Держателем карты для оплаты Услуг  Поставщика. Оплата Услуг Поставщика в соответствии с настоящим Соглашением возможна Банковскими картами платежных систем VISA International, MasterCard International, зарегистрированными в соответствии с действующим законодательством Российской Федерации. При этом возможность использования конкретных видов карт VISA International и MasterCard International устанавливает Банк-эмитент. 
Акцепт Пользователя – безусловное соглашение Пользователя с условиями настоящего Соглашения. 
Личный кабинет – раздел Сайта Поставщика, защищенный системой контроля доступа, обеспечивающий Пользователю интерфейс для взаимодействия с Поставщиком по Договору. 
Сайт Поставщика — сайт, размещенный в сети Интернет по адресу: https://moneyhunter.pro/.</h2>
        <h2 class="offer-desc-2-title">Описание сервиса “Рекуррентные списания” и способ его активации</h2>
        <h2 class="offer-desc-2-desc">
          1.Сервис «Рекуррентные списания» позволяет Пользователю оплачивать Услуги Поставщика по Договору путём регулярных автоматических переводов денежных средств в пользу Поставщика с Банковских карт. Активация (подключение) Сервиса «Рекуррентные списания» предполагает выполнение следующих действий: 
          <br/>1.1 В Личном кабинете на Сайте Поставщика Пользователь выбирает раздел «Платежи», подраздел «Сделать платеж». Пользователь выбирает оплату очередного платежа и ставит флажок напротив пункта «Подключить Автоматический платеж», соглашаясь с настоящим Соглашением пользования Сервисом «Рекуррентные списания», и нажимает кнопку «Оплатить». Сервис «Рекуррентные списания» подключается только для Банковской карты, зарегистрированной Держателем карты. 
          <br/>1.2 Регистрация Банковской карты: Держатель карты вводит на WEB-странице ввода платежных данных данные своей Банковской карты; 
          <br/>2. Действие Сервиса «Рекуррентные списания». 
          <br/>2.1. После подключения Сервиса «Рекуррентные списания», с Банковской карты будут осуществляться переводы денежных средств в сроки и размерах, необходимых для надлежащего исполнения обязанности Пользователя по Договору. 
          <br/>2.2. Непосредственное списание денежных средств осуществляет Банк-эмитент на основании заранее данного согласия Пользователя на подобное списание в сумме и в срок, указанные в Договоре. Запрос на перевод денежных средств с указанием суммы перевода в Банк-эмитент передается Банком и Процессинговым центром в рамках заключенных с Поставщиком соглашений. 
          <br/>2.3. В один момент времени, у Пользователя может быть активирован (подключён) Сервис «Рекуррентные списания» только по одной Банковской карте платёжной системы Visa (Visa Inc.), MasterCard или Maestro (MasterCard International Inc.). 
          <br/>2.4. Поставщик не хранит и не обрабатывает данные банковских карт Пользователей, а также иные персональные данные Пользователей, обеспечивая лишь запросы в Процессинговый центр и Банк для повторного проведения операции по банковской карте Пользователя. 
          <br/>2.5. Поставщик не гарантирует возможность проведения операций по Банковской карте. 
          <br/>2.6. Пользователь гарантирует, что он является Держателем банковской карты, осознанно, корректно и полностью вводит все требуемые реквизиты Банковской карты при активации (подключении) Сервиса «Рекуррентные списания». 
          <br/>2.7. Совершение действий, предусмотренных п. п.1.1. Соглашения признается аналогом собственноручной подписи Пользователя. 
          <br/>2.8. Подключение Сервиса «Рекуррентные списания» в порядке, предусмотренном настоящим Соглашением пользования сервисом, осуществляется только при наличии технической возможности Поставщика, Процессингового центра, Банка, Банка-эмитента. Поставщик, Процессинговый центр, Банк не несут ответственность за невозможность подключения Сервиса «Рекуррентные списания». 
          <br/>2.9. Поставщик имеет право вносить изменения в настоящее Соглашение пользования сервисом, заранее уведомив об этом Пользователя в письменной форме либо иным доступным способом, в том числе путем сообщения на электронную почту, указанную в Договоре Пользователем, либо телефонограммой, либо размещением информации на Веб-Сайте Поставщика. 
          <br/>3. Отключение Сервиса «Рекуррентные списания». 
          <br/>3.1. Отключение (отказ) Пользователя от Сервиса «Рекуррентные списания» происходит в следующем порядке: 
          <br/>А) В «Личном кабинете» Пользователь выбирает раздел «Платежи», подраздел «Сделать платеж». 
          <br/>Б) Нажимает кнопку «Отключить сервис «Автоматический платеж». При этом денежные средства, переведенные с Банковской карты до отключения (отказа) Пользователя от Сервиса «Рекуррентные списания» за Услуги, Пользователю не возвращаются. 
          <br/>3.2. В случае недостаточности денежных средств на счете Банковской карты для осуществления перевода Поставщик имеет право повторять запрос на списание с Банковской карты денежных средств. 
          <br/>4. Ограничения при пользовании Сервисом «Рекуррентные списания». 
          <br/>4.1. С одной Банковской карты может быть проведено не более 5 (пяти) переводов в сутки.
          <br/>4.2. С одной Банковской карты может быть осуществлен перевод не более, чем на 15000 рублей за одну операцию. 
          <br/>4.3. С одной Банковской карты может быть осуществлено переводов не более, чем на 50000 рублей в сутки. 
          <br/>4.4. Переход на страницу «Сделать платеж» возможен лишь в случае, если у Пользователя подключено соединение к сети Интернет, независимо от текущего состояния счёта. 
          <br/>5. Ответственность сторон. 
          <br/>5.1. Поставщик, Процессинговый центр, Банк не несут ответственности за неработоспособность и/или временную неработоспособность Сервиса «Рекуррентные списания». Пользователь самостоятельно контролирует исполнение своей обязанности по оплате по Договору. При неработоспособности и/или временной неработоспособности Сервиса «Рекуррентные списания» Пользователь обязан использовать иные способы исполнения обязанностей по Договору. 
          <br/>5.2. Споры сторон, возникшие в связи с выполнением условий настоящего Соглашения, разрешаются в ходе направления претензий. 
          <br/>5.3. В случае недостижения Сторонами взаимного согласия, споры между ними разрешаются в соответствии с условиями Договора и Оферты. 
          <br/>6. Прочие условия.
          <br/>6.1. Выполняя действия по подключению Сервиса «Рекуррентные списания»: 
          <br/>А) Пользователь безусловно соглашается со всеми условиями настоящего Соглашения. 
          <br/>Б) Пользователь дает заранее данный акцепт на списание денежных средств Поставщиком с Банковской карты на условиях настоящего Соглашения. 
          <br/>В) Пользователь предоставляет право Процессинговому Центру, Банку хранить, собирать, обрабатывать свои персональные данные (Фамилию, Имя, Отчество, серию и номер паспорта, место и дату рождения, номер расчетного счета и Банковской карты) с целью реализации настоящего Соглашения. 
          <br/>Г) Пользователь дает согласие на оплату Услуг в соответствии с условиями Соглашения. 
          <br/>6.2. Поставщик имеет право отключить и/или ограничить Пользователя от Сервиса «Рекуррентные списания».
        </h2>
        <h2 class="offer-desc-2-desc">Права и обязанности Пользователя и Поставщика, вытекающие из настоящей оферты, не могут быть переданы третьим лицам без письменного согласия другой стороны. 
<br/>Я, Пользователь, ознакомлен и согласен с настоящим соглашением использования сервиса “Рекуррентные платежи”, с автоматическим списанием денежных средств с банковской карты за услуги Поставщика по Договору.</h2>
      </div>
    </template>
  </Modal>
</template>

<script>
  import Modal from "@/components/Modal";
  export default {
    name: "AddPosition",
    components: {
     Modal
    },
  }
</script>

<style scoped lang="scss">
  .offer-modal-template {
    padding: 10px 15px;
    max-height: 100%;
    overflow-y: scroll;
    margin-top: 10px;
  }
  .offer-title {
    font-size: .8rem;
    text-transform: uppercase;
    color: #9FA2B4;
    text-align: center;
  }
  .offer-desc {
    font-size: 1rem;
    text-align: left;
    font-weight: 300;
    margin-top: 10px;
    line-height: 1;
  }
  .offer-desc-2-title {
    font-size: 1.1rem;
    text-align: center;
    margin-top: 10px;
  }
  .offer-desc-2-desc {
    font-size: 1rem;
    text-align: left;
    font-weight: 300;
    margin-top: 10px;
  }
</style>